feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Dma/Dma/IfxDma_Dma.h
/** \} */

/** \addtogroup IfxLld_Dma_Dma_Module_Initialize
 * \{ */

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief initializes a DMA module handle based on the current configuration.
 * Can be used in code where it's ensure that the DMA module is already initialized, and a DMA handle isn't globally available.
 * \param dmaHandle pointer to the DMA module handle
 * \param dma pointer to the DMA registers
 * \return None
 *
 * \code
 *      IfxDma_Dma dma;
 *      IfxDma_Dma_createModuleHandle(&dma, &MODULE_DMA);
 * \endcode
 *
 */
IFX_EXTERN void IfxDma_Dma_createModuleHandle(IfxDma_Dma *dmaHandle, Ifx_DMA *dma);

/** \brief de-initialize the DMA channel
 * \param dma pointer to the DMA module handle
 * \param channel the DMA channel ID
 * \return None
 */
IFX_EXTERN void IfxDma_Dma_deInitChannel(IfxDma_Dma *dma, IfxDma_ChannelId channel);

/** \brief Initialize the DMA module
 * \param dma pointer to the DMA module handle
 * \param config Pointer to configuration structure of the DMA module
 * \return None
 *
 * See \ref IfxLld_Dma_Dma_Simple
 *
 */
IFX_EXTERN void IfxDma_Dma_initModule(IfxDma_Dma *dma, const IfxDma_Dma_Config *config);

/** \brief initialize the DMA module configuration
 * \param config Pointer to configuration structure of the DMA module
 * \param dma pointer to the DMA registers
 * \return None
 *
 * See \ref IfxLld_Dma_Dma_Simple
 *
 */
IFX_EXTERN void IfxDma_Dma_initModuleConfig(IfxDma_Dma_Config *config, Ifx_DMA *dma);

/** \} */

/** \addtogroup IfxLld_Dma_Dma_Channel_Initialize
 * \{ */

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief initialize the DMA channel
 * \param channel pointer to the DMA base address and channel ID
 * \param config pointer to the DMA default channel configuration structure
 * \return None
 *
 * See \ref IfxLld_Dma_Dma_Simple
 *
 */
IFX_EXTERN void IfxDma_Dma_initChannel(IfxDma_Dma_Channel *channel, const IfxDma_Dma_ChannelConfig *config);

/** \brief initialize the DMA module channel configuration
 * \param config pointer to the DMA default channel configuration structure
 * \param dma pointer to the DMA module handle
 * \return None
 *
 * See \ref IfxLld_Dma_Dma_Simple
 *
 */
IFX_EXTERN void IfxDma_Dma_initChannelConfig(IfxDma_Dma_ChannelConfig *config, IfxDma_Dma *dma);

/** \} */

/** \addtogroup IfxLld_Dma_Dma_Linked_List
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the SRC pointer for given DMA channel
 * \param channel pointer to the DMA base address and channel ID
 * \return SRC pointer for given DMA channel
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxDma_Dma_getSrcPointer(IfxDma_Dma_Channel *channel);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief linked list functionality within the DMA module
 * \param ptrToAddress pointer to the memory location where the linked list entry should be stored
 * \param config pointer to the DMA default channel configuration structure
 * \return None
 *
 * See \ref IfxLld_Dma_Dma_LinkedList
 *
 */
IFX_EXTERN void IfxDma_Dma_initLinkedListEntry(void *ptrToAddress, const IfxDma_Dma_ChannelConfig *config);

/** \} */

/** \addtogroup IfxLld_Dma_Dma_Channel_Transaction_Initiate
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Clear a channel transfer interrupt flag
 * \param channel pointer to the DMA base address and channel ID
 * \return None
 */
IFX_INLINE void IfxDma_Dma_clearChannelInterrupt(IfxDma_Dma_Channel *channel);

/** \brief Return and clear a channel transfer interrupt flag
 * The flag is automatically cleared with the call to this function
 * \param channel pointer to the DMA base address and channel ID
 * \return TRUE if the interrupt flag is set
 * FALSE if the interrupt flag is not set
 */
IFX_INLINE boolean IfxDma_Dma_getAndClearChannelInterrupt(IfxDma_Dma_Channel *channel);

/** \brief Return a channel transfer interrupt flag
 * \param channel pointer to the DMA base address and channel ID
 * \return TRUE if the interrupt flag is set
 * FALSE if the interrupt flag is not set
 */
IFX_INLINE boolean IfxDma_Dma_getChannelInterrupt(IfxDma_Dma_Channel *channel);

/** \brief Poll for an ongoing transaction
 * \param channel pointer to the DMA base address and channel ID
 * \return TRUE if a transaction request for the given channel is pending
 *
 * See \ref IfxLld_Dma_Dma_Simple
 *
 */
IFX_INLINE boolean IfxDma_Dma_isChannelTransactionPending(IfxDma_Dma_Channel *channel);

/** \brief Re-initialize the destination address after a transaction
 * \param channel pointer to the DMA base address and channel ID
 * \param address is the Initial address of the destination pointer
 * \return None
 *
 * See \ref IfxLld_Dma_Dma_Simple
 *
 */
IFX_INLINE void IfxDma_Dma_setChannelDestinationAddress(IfxDma_Dma_Channel *channel, uint32 address);

/** \brief Re-initialize the source address after a transaction
 * \param channel pointer to the DMA base address and channel ID
 * \param address is the Initial address of the source pointer
 * \return None
 *
 * See \ref IfxLld_Dma_Dma_Simple
 *
 */
IFX_INLINE void IfxDma_Dma_setChannelSourceAddress(IfxDma_Dma_Channel *channel, uint32 address);

/** \brief Re-initialize the transfer count after a transaction
 * \param channel pointer to the DMA base address and channel ID
 * \param transferCount value holds the DMA transfers within a transaction (1..16383; 0 handled like 1 transaction)
 * \return None
 *
 * See \ref IfxLld_Dma_Dma_Simple
 *
 */
IFX_INLINE void IfxDma_Dma_setChannelTransferCount(IfxDma_Dma_Channel *channel, uint32 transferCount);

